kakaZzzz/TonyWatch/STM32Cube_FW_F4_V1.3.0/Projects/STM32F4-Discovery/Templates/Src/main.c
/***********************************************************************************/
/***********************************************************************************/
/**
  * @brief  This function handles External line 4 interrupt request.
  * @param  None
  * @retval None
  */
void EXTI4_IRQHandler(void)
{
	static portBASE_TYPE xHigherPriorityTaskWoken;
  	HAL_GPIO_EXTI_IRQHandler(AFE44XX_ADRDY_PIN);//?“辰??D??辰y??㏒?GPIO?D?㏒那?????∩ㄓ﹞⊿﹞?那?
	xHigherPriorityTaskWoken = pdFALSE;
	xSemaphoreGiveFromISR(xBinarySemaphore, &xHigherPriorityTaskWoken);//﹞⊿3?芍???
	if(xHigherPriorityTaskWoken == pdTRUE)
	{
		vTaskSwitchContext();
	}	
}
/**
  * @brief  Main program
  * @param  None
  * @retval None
  */
/*********************************************************/
//*******************************************************//
///*************** AFE44XX IT TASK  CONTROL FOR freeRTOS
//******************************************************//
void vHandlerAFE44xxITTASK(void const *argument)
{
	//portTickType xLastWakeTime;
	//xLastWakeTime = xTaskGetTickCount();
	//const portTickType xTicksToWait = 10/portTICK_RATE_MS;
	for(;;)
	{
		xSemaphoreTake(xBinarySemaphore,portMAX_DELAY); //??豕?芍???
		//xSemaphoreTake(xBinarySemaphore,xTicksToWait);
		AFE44xxInitialData = AFE44xx_RecData();
		//xQueueSendToBack(xQueue, &AFE44xxInitialData,portMAX_DELAY);
		osMessagePut (xQueue, (uint32_t)AFE44xxInitialData, portMAX_DELAY);
		osDelay(50);//		osDelay(10);
		//osDelayUntil(xLastWakeTime,10);
		// UART_printf(&huart1, (uint8_t*)printf_IT_sucess,COUNTOF(printf_IT_sucess)-1);
	}
}
void vReceiveAFE44xxDataTask(void const *argument)
{
	//    portBASE_TYPE xStatus;
	osEvent osEventAFE44XX;
	//portTickType xLastWakeTime;
	//xLastWakeTime = xTaskGetTickCount();
	//const portTickType xTicksToWait = 10/portTICK_RATE_MS;
	//uint8_t TxSample[128];
	//uint8_t *pPara1;
	//for(uint8_t i=0;i<128;i++)
	//{
	//	TxSample[i]=i;
	//}
	for(;;)
	{
		if(uxQueueMessagesWaiting(xQueue) !=0) //?D???車芍D?D那?﹞?車D那y?Y
		{
			//UART_printf(&huart1, (uint8_t*)printf_Queue_data_exist,COUNTOF(printf_Queue_data_exist)-1);
		}
		//xStatus = xQueueReceive(xQueue, &AFE44xxInitialData_ADDR,portMAX_DELAY);
		osEventAFE44XX = osMessageGet (xQueue, portMAX_DELAY);
		//if(xStatus == pdPASS)
		if(osEventAFE44XX.status == osEventMessage)
		{
			//sprintf(aTxBuffer_initialdata,"%lx\n%lx\n%lx\n",*AFE44xxInitialData_ADDR,*(AFE44xxInitialData_ADDR+1),*(AFE44xxInitialData_ADDR+2));
//in order to debug uart sending, weizhong comment the following two lines

//			sprintf(aTxBuffer_initialdata,"%lx\n%lx\n%lx\n",*(long *)osEventAFE44XX.value.v,*((long *)osEventAFE44XX.value.v+1),*((long *)osEventAFE44XX.value.v+2));
//			UART_printf(&huart1, (uint8_t *)aTxBuffer_initialdata,COUNTOF(aTxBuffer_initialdata)-1);  

//			pPara1=osEventAFE44XX.value.p;
//			if(flagBleConStatus==BLE_STATUS_CONNECTED)
//			{
//				TxSampleSend(aPackHeader,10);
//				TxSampleSend(pPara1,12);
//				TxSampleSend(aPackHip,10);
//			}
			if(flagBleConStatus==BLE_STATUS_CONNECTED)
			{
				packHeartRateData(osEventAFE44XX);
			}
			else
			{
				gPackCnt=0;
			}
		}
		else
		{
			//UART_printf(&huart1, (uint8_t*)printf_Receiving_error,COUNTOF(printf_Receiving_error)-1);
		}
		osDelay(50);
	}
}
/*
Block0: 	0~7 		//start time,length=8B		offset=0
Block1:		8~22 		//data1,length=15B			offset=8
Block2:		23~75 		//data2,length=53B			offset=23
Block3:		76~128	//data3,length=53B			offset=76

*/

void initHeartRateDataType(void)
{
	gHeartRateValueHeader[0]=0x01;
	gHeartRateValueHeader[1]=0x11;
	gHeartRateValueHeader[2]=0x22;
	gHeartRateValueHeader[3]=0x33;
	gHeartRateValueHeader[4]=0x44;
	gHeartRateValueHeader[5]=0x55;
	gHeartRateValueHeader[6]=0x66;
	gHeartRateValueHeader[7]=0x77;
	gHeartRateValueHeader[8]=0x88;
	gHeartRateValueHeader[9]=0xF4;
	gHeartRateValueHeader[10]=0x01;
	gHeartRateValueHeader[11]=0x02;
	gHeartRateValueHeader[12]=0x00;
	
	gHeartRateRawHeader[0]=0x02;
	gHeartRateRawHeader[1]=0x11;
	gHeartRateRawHeader[2]=0x22;
	gHeartRateRawHeader[3]=0x33;
	gHeartRateRawHeader[4]=0x44;
	gHeartRateRawHeader[5]=0x55;
	gHeartRateRawHeader[6]=0x66;
	gHeartRateRawHeader[7]=0x77;
	gHeartRateRawHeader[8]=0x88;
	gHeartRateRawHeader[9]=0x32;
	gHeartRateRawHeader[10]=0x00;
	gHeartRateRawHeader[11]=0x28;
	gHeartRateRawHeader[12]=0x00;
	
	gHeartRateProcessHeader[0]=0x03;
	gHeartRateProcessHeader[1]=0x11;
	gHeartRateProcessHeader[2]=0x22;
	gHeartRateProcessHeader[3]=0x33;
	gHeartRateProcessHeader[4]=0x44;
	gHeartRateProcessHeader[5]=0x55;
	gHeartRateProcessHeader[6]=0x66;
	gHeartRateProcessHeader[7]=0x77;
	gHeartRateProcessHeader[8]=0x88;
	gHeartRateProcessHeader[9]=0x32;
	gHeartRateProcessHeader[10]=0x00;
	gHeartRateProcessHeader[11]=0x28;
	gHeartRateProcessHeader[12]=0x00;

	sysTime.sec=0x11223344;
	sysTime.msec=0x55667788;
}
	
void packHeartRateData(osEvent data)
{
	uint32_t data0=*((long *)data.value.v+0);
	uint32_t data1=*((long *)data.value.v+1);
//	uint32_t data2=*((long *)data.value.v+2);
	
	if(gPackCnt==1)
	{
		memset(gHeartRateTxPack,0,HR_PACK_LENGTH);//clear package
		ghr_block1_offset=0;
		ghr_block2_offset=0;
		ghr_block3_offset=0;
		
		memcpy(gHeartRateTxPack+HR_BLOCK0_BASE,&sysTime,sizeof(sysTime));//start time
		
//		memcpy(gHeartRateTxPack+HR_BLOCK1_BASE,&gHeartRateValue,sizeof(gHeartRateValue));//header
//		ghr_block1_offset=HR_BLOCK1_BASE+sizeof(gHeartRateValue);
//		memcpy(gHeartRateTxPack+ghr_block1_offset,&gHeartRate,sizeof(gHeartRate));//data
		memcpy(gHeartRateTxPack+HR_BLOCK1_BASE,&gHeartRateValueHeader,DATA_HEADER_LENGTH);//data1 header
		ghr_block1_offset=HR_BLOCK1_BASE+DATA_HEADER_LENGTH;
		memcpy(gHeartRateTxPack+ghr_block1_offset,&gHeartRate,SIZEOF_DATA1);//piece1 of data1
		ghr_block1_offset+=SIZEOF_DATA1;
		
//		memcpy(gHeartRateTxPack+HR_BLOCK2_BASE,&gHeartRateRaw,sizeof(gHeartRateRaw));//header
//		ghr_block2_offset=HR_BLOCK2_BASE+sizeof(gHeartRateRaw);
//		memcpy(gHeartRateTxPack+ghr_block2_offset,&data0,sizeof(data0));//data
		memcpy(gHeartRateTxPack+HR_BLOCK2_BASE,&gHeartRateRawHeader,DATA_HEADER_LENGTH);//header
		ghr_block2_offset=HR_BLOCK2_BASE+DATA_HEADER_LENGTH;
		memcpy(gHeartRateTxPack+ghr_block2_offset,&data0,SIZEOF_DATA2);//data
		ghr_block2_offset+=SIZEOF_DATA2;
		
