kakaZzzz/TonyWatch/STM32Cube_FW_F4_V1.3.0/Projects/STM32F4-Discovery/Templates/Src/main.c
//		memcpy(gHeartRateTxPack+HR_BLOCK3_BASE,&gHeartRateProcess,sizeof(gHeartRateProcess));//header
//		ghr_block3_offset=HR_BLOCK3_BASE+sizeof(gHeartRateProcess);
//		memcpy(gHeartRateTxPack+ghr_block3_offset,&data1,sizeof(data1));//data
		memcpy(gHeartRateTxPack+HR_BLOCK3_BASE,&gHeartRateProcessHeader,DATA_HEADER_LENGTH);//header
		ghr_block3_offset=HR_BLOCK3_BASE+DATA_HEADER_LENGTH;
		memcpy(gHeartRateTxPack+ghr_block3_offset,&data1,SIZEOF_DATA3);//data
		ghr_block3_offset+=SIZEOF_DATA3;
	}
	else if((gPackCnt>=2)&&(gPackCnt<=10))
	{
//		memcpy(gHeartRateTxPack+ghr_block1_offset+sizeof(gHeartRate)*(gPackCnt-1),&gHeartRate,sizeof(gHeartRate));
//		memcpy(gHeartRateTxPack+ghr_block2_offset+sizeof(gHeartRateRaw)*(gPackCnt-1),&gHeartRateRaw,sizeof(gHeartRateRaw));
//		memcpy(gHeartRateTxPack+ghr_block3_offset+sizeof(gHeartRateProcess)*(gPackCnt-1),&gHeartRateProcess,sizeof(gHeartRateProcess));

		//HeartRateValue only has one data in 500ms, so here we comments it out
//		memcpy(gHeartRateTxPack+ghr_block1_offset+sizeof(gHeartRate)*(gPackCnt-1),&gHeartRate,sizeof(gHeartRate));
		memcpy(gHeartRateTxPack+ghr_block2_offset,&data0,SIZEOF_DATA2);
		ghr_block2_offset+=SIZEOF_DATA2;
		memcpy(gHeartRateTxPack+ghr_block3_offset,&data1,SIZEOF_DATA3);
		ghr_block3_offset+=SIZEOF_DATA3;
	}
	else
	{
		
	}

	if(gPackCnt==10)
	{
		memcpy(gHeartRateTxPackBuf,gHeartRateTxPack,HR_PACK_LENGTH);
		gPackCnt=0;
		flagHRDSend=true;
//		xSemaphoreGive(xBinSemaHeartRateSend);
	}
	gPackCnt++;
	/*
	switch(gPackStatus)
	{
		case PACK_STATUS_HEADER:
			//part1: start time
			gHeartRateTxPack[0+HR_BLOCK0_OFFSET]=BREAK_UINT32(gSystemTimeInS,0);
			gHeartRateTxPackCnt++;
			gHeartRateTxPack[1+HR_BLOCK0_OFFSET]=BREAK_UINT32(gSystemTimeInS,1);
			gHeartRateTxPackCnt++;
			gHeartRateTxPack[2+HR_BLOCK0_OFFSET]=BREAK_UINT32(gSystemTimeInS,2);
			gHeartRateTxPackCnt++;
			gHeartRateTxPack[3+HR_BLOCK0_OFFSET]=BREAK_UINT32(gSystemTimeInS,3);
			gHeartRateTxPackCnt++;
			gHeartRateTxPack[4+HR_BLOCK0_OFFSET]=BREAK_UINT32(gSystemTimeInMS,0);
			gHeartRateTxPackCnt++;
			gHeartRateTxPack[5+HR_BLOCK0_OFFSET]=BREAK_UINT32(gSystemTimeInMS,1);
			gHeartRateTxPackCnt++;
			gHeartRateTxPack[6+HR_BLOCK0_OFFSET]=BREAK_UINT32(gSystemTimeInMS,2);
			gHeartRateTxPackCnt++;
			gHeartRateTxPack[7+HR_BLOCK0_OFFSET]=BREAK_UINT32(gSystemTimeInMS,3);
			gHeartRateTxPackCnt++;
			//part2: data type
			gHeartRateTxPack[HR_BLOCK1_OFFSET+0]=0x01;
			gHeartRateTxPack[HR_BLOCK2_OFFSET+0]=0x02;
			gHeartRateTxPack[HR_BLOCK3_OFFSET+0]=0x03;
			//part3: data start time
			gHeartRateTxPack[HR_BLOCK1_OFFSET+1]=BREAK_UINT32(gSystemTimeInS,0);
			gHeartRateTxPack[HR_BLOCK1_OFFSET+2]=BREAK_UINT32(gSystemTimeInS,1);
			gHeartRateTxPack[HR_BLOCK1_OFFSET+3]=BREAK_UINT32(gSystemTimeInS,2);
			gHeartRateTxPack[HR_BLOCK1_OFFSET+4]=BREAK_UINT32(gSystemTimeInS,3);
			gHeartRateTxPack[HR_BLOCK1_OFFSET+5]=BREAK_UINT32(gSystemTimeInMS,4);
			gHeartRateTxPack[HR_BLOCK1_OFFSET+6]=BREAK_UINT32(gSystemTimeInMS,5);
			gHeartRateTxPack[HR_BLOCK1_OFFSET+7]=BREAK_UINT32(gSystemTimeInMS,6);
			gHeartRateTxPack[HR_BLOCK1_OFFSET+8]=BREAK_UINT32(gSystemTimeInMS,7);
			
			gHeartRateTxPack[HR_BLOCK2_OFFSET+1]=BREAK_UINT32(gSystemTimeInS,0);
			gHeartRateTxPack[HR_BLOCK2_OFFSET+2]=BREAK_UINT32(gSystemTimeInS,1);
			gHeartRateTxPack[HR_BLOCK2_OFFSET+3]=BREAK_UINT32(gSystemTimeInS,2);
			gHeartRateTxPack[HR_BLOCK2_OFFSET+4]=BREAK_UINT32(gSystemTimeInS,3);
			gHeartRateTxPack[HR_BLOCK2_OFFSET+5]=BREAK_UINT32(gSystemTimeInMS,4);
			gHeartRateTxPack[HR_BLOCK2_OFFSET+6]=BREAK_UINT32(gSystemTimeInMS,5);
			gHeartRateTxPack[HR_BLOCK2_OFFSET+7]=BREAK_UINT32(gSystemTimeInMS,6);
			gHeartRateTxPack[HR_BLOCK2_OFFSET+8]=BREAK_UINT32(gSystemTimeInMS,7);
			
			gHeartRateTxPack[HR_BLOCK3_OFFSET+1]=BREAK_UINT32(gSystemTimeInS,0);
			gHeartRateTxPack[HR_BLOCK3_OFFSET+2]=BREAK_UINT32(gSystemTimeInS,1);
			gHeartRateTxPack[HR_BLOCK3_OFFSET+3]=BREAK_UINT32(gSystemTimeInS,2);
			gHeartRateTxPack[HR_BLOCK3_OFFSET+4]=BREAK_UINT32(gSystemTimeInS,3);
			gHeartRateTxPack[HR_BLOCK3_OFFSET+5]=BREAK_UINT32(gSystemTimeInMS,4);
			gHeartRateTxPack[HR_BLOCK3_OFFSET+6]=BREAK_UINT32(gSystemTimeInMS,5);
			gHeartRateTxPack[HR_BLOCK3_OFFSET+7]=BREAK_UINT32(gSystemTimeInMS,6);
			gHeartRateTxPack[HR_BLOCK3_OFFSET+8]=BREAK_UINT32(gSystemTimeInMS,7);
			//part4: data period
			gHeartRateTxPack[HR_BLOCK1_OFFSET+9]=0xf4;//0x01f4=500
			gHeartRateTxPack[HR_BLOCK1_OFFSET+10]=0x01;
			gHeartRateTxPack[HR_BLOCK2_OFFSET+9]=0x32;//0x0032=50
			gHeartRateTxPack[HR_BLOCK2_OFFSET+10]=0x00;
			gHeartRateTxPack[HR_BLOCK3_OFFSET+9]=0x32;//0x0032=50
			gHeartRateTxPack[HR_BLOCK3_OFFSET+10]=0x00;
			//part5: data length
			gHeartRateTxPack[HR_BLOCK1_OFFSET+11]=0x02;//0x0002=2
			gHeartRateTxPack[HR_BLOCK1_OFFSET+12]=0x00;
			gHeartRateTxPack[HR_BLOCK2_OFFSET+11]=0x28;//0x0028=40
			gHeartRateTxPack[HR_BLOCK2_OFFSET+12]=0x00;
			gHeartRateTxPack[HR_BLOCK3_OFFSET+11]=0x28;//0x0028=40
			gHeartRateTxPack[HR_BLOCK3_OFFSET+12]=0x00;
			//part6: data body 
			gHeartRateTxPack[HR_BLOCK1_OFFSET+13]=LO_UINT16(gHeartRate);//data1
			gHeartRateTxPack[HR_BLOCK1_OFFSET+14]=HI_UINT16(gHeartRate);
			gHeartRateTxPack[HR_BLOCK2_OFFSET+13]=BREAK_UINT32(*((long *)data.value.v+0),0);//data2
			gHeartRateTxPack[HR_BLOCK2_OFFSET+14]=BREAK_UINT32(*((long *)data.value.v+0),1);
			gHeartRateTxPack[HR_BLOCK2_OFFSET+15]=BREAK_UINT32(*((long *)data.value.v+0),2);
			gHeartRateTxPack[HR_BLOCK2_OFFSET+16]=BREAK_UINT32(*((long *)data.value.v+0),3);
			gHeartRateTxPack[HR_BLOCK3_OFFSET+13]=BREAK_UINT32(*((long *)data.value.v+1),0);//data3
			gHeartRateTxPack[HR_BLOCK3_OFFSET+14]=BREAK_UINT32(*((long *)data.value.v+1),1);
			gHeartRateTxPack[HR_BLOCK3_OFFSET+15]=BREAK_UINT32(*((long *)data.value.v+1),2);
			gHeartRateTxPack[HR_BLOCK3_OFFSET+16]=BREAK_UINT32(*((long *)data.value.v+1),3);
			gDataClass=1;
			break;
		case PACK_STATUS_BODY:
			if(gDataClass==1)
			{
				gHeartRateTxPack[HR_BLOCK1_OFFSET+15]=LO_UINT16(gHeartRate);
				gHeartRateTxPack[HR_BLOCK1_OFFSET+16]=HI_UINT16(gHeartRate);
				gHeartRateTxPack[HR_BLOCK2_OFFSET+17]=BREAK_UINT32(*((long *)data.value.v+0),0);//data2
				gHeartRateTxPack[HR_BLOCK2_OFFSET+18]=BREAK_UINT32(*((long *)data.value.v+0),1);
				gHeartRateTxPack[HR_BLOCK2_OFFSET+19]=BREAK_UINT32(*((long *)data.value.v+0),2);
				gHeartRateTxPack[HR_BLOCK2_OFFSET+20]=BREAK_UINT32(*((long *)data.value.v+0),3);
				gHeartRateTxPack[HR_BLOCK3_OFFSET+17]=BREAK_UINT32(*((long *)data.value.v+1),0);//data3
				gHeartRateTxPack[HR_BLOCK3_OFFSET+18]=BREAK_UINT32(*((long *)data.value.v+1),1);
				gHeartRateTxPack[HR_BLOCK3_OFFSET+19]=BREAK_UINT32(*((long *)data.value.v+1),2);
				gHeartRateTxPack[HR_BLOCK3_OFFSET+20]=BREAK_UINT32(*((long *)data.value.v+1),3);
			}
			else//gDataClass!=1
			{
				gHeartRateTxPack[]
				
